OpenFOAM-2.4.0/tutorials/heatTransfer/buoyantSimpleFoam/externalCoupledCavity/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.12;

boundaryField
{
    frontAndBack
    {
        type            compressible::omegaWallFunction;
        value           uniform 0.12;
    }
    topAndBottom
    {
        type            compressible::omegaWallFunction;
        value           uniform 0.12;
    }
    hot
    {
        type            compressible::omegaWallFunction;
        value           uniform 0.12;
    }
    cold
    {
        type            compressible::omegaWallFunction;
        value           uniform 0.12;
    }
}


// ************************************************************************* //
